//Завдання 1:

// Дано масив чисел [1, 2, 3, 4, 5]. Створіть новий масив, що містить 
// квадрати кожного елементу вхідного масиву. 
// Очікуваний результат: [1, 4, 9, 16, 25].

//  const numbers = [1, 2, 3, 4, 5];
//  const squares = numbers.map((num) => num * num);
//  console.log(squares);
 /////////////////////////////////////////////////////////////
 //Завдання 2:

// Дано масив об'єктів. Створіть новий масив, що містить всі значення 
// з масивів values кожного об'єкту, збережених в одному масиві. 
// Очікуваний результат: [1, 2, 3, 4, 5, 6, 7, 8, 9].

// const data = [
//  { id: 1, values: [1, 2, 3] },
//  { id: 2, values: [4, 5, 6] },
//  { id: 3, values: [7, 8, 9] },
// ];
  
// const array = data.flatMap((ar) => ar.values);
// console.log(array);
////////////////////////////////////////////////////////////////////////
// //Завдання 5:

// // Знайдіть перше непарне число

// const numbers = [2, 1, 6, 8, 9, 10, 12];
// const evenNumber = numbers.find(num => num % 2 !== 0);
// console.log(evenNumber);
/////////////////////////////////////////////////////////////////////////////////////////
//Завдання 6:

// Відсортуйте масив чисел [4, 2, 5, 1, 3] 
// у порядку зростання. Очікуваний результат: [1, 2, 3, 4, 5].

// const numbersArray = [4, 2, 5, 1, 3];


// const array = numbersArray.toSorted((a, b) => a - b);
// console.log(array);  // [1, 2, 3, 4, 5]    
//////////////////////////////////////////////////////////////////////////
//Завдання 7:

// Відсортуйте масив рядків ["banana", "orange", "apple", "pear"]
//  у порядку алфавіту. 
// Очікуваний результат: ["apple", "banana", "orange", "pear"].
// const stringArray = ['banana', 'orange', 'apple', 'pear'];
// const array = stringArray.toSorted((a, b) => a.localeCompare(b));

// console.log(array);
//////////////////////////////////////////////////////////////////////////////////////
//Завдання 8:

//  Відсортуйте масив об'єктів за віком у порядку зростання. 
// Очікуваний результат: [{name: "Bob", age: 19}, {name: "John", age: 27}, {name: "Jane", age: 31}].

// const users = [
//  { name: 'John', age: 27 },
//  { name: 'Jane', age: 31 },
//  { name: 'Bob', age: 19 },

// ];
// const array = users.map((ar) => ar.age).toSorted((a, b) => a - b);

// console.log(array);
//////////////////////////////////////////////////////////////////////////////////
//Завдання 9:

// Дано масив об'єктів. 
// Створіть новий масив, що містить тільки об'єкти, в яких 
// вік більше 20 років. 
// Очікуваний результат: [{name: "John", age: 27}, {name: "Jane", age: 31}]
// Знайди імена користувачів, яким більше 25 років.
// Поверни true, якщо всі користувачі старші за 18.
// const user = [
//  { name: 'John', age: 27 },
//  { name: 'Jane', age: 31 },
//  { name: 'Bob', age: 19 },
// ]

// //const nuwArray = user.filter((item) => item.age > 25)
//  //                    .map((user) => user.name);
//  const adultos = user.every((adultos) => adultos.age > 18);
//  console.log(adultos);

// //console.log(nuwArray);

/////////////////////////////////////////////////////////////////////////////////////////////////////
//Завдання 10:

// Дано масив чисел [1, 2, 3, 4, 5]. 
// Застосуйте метод для обчислення суми елементів масиву.

// const numbers = [1, 2, 3, 4, 5];


































